tests/load_tests/hey/get_hey_n_requests/get_90_requests.txt
hey -n 90 http://127.0.0.1:8080/v1/airports/5

Summary:
  Total:	0.3627 secs
  Slowest:	0.3579 secs
  Fastest:	0.0759 secs
  Average:	0.2840 secs
  Requests/sec:	137.8455
  
  Total data:	2750 bytes
  Size/request:	55 bytes

Response time histogram:
  0.076 [1]	|■■■
  0.104 [0]	|
  0.132 [0]	|
  0.160 [0]	|
  0.189 [1]	|■■■
  0.217 [1]	|■■■
  0.245 [10]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.273 [7]	|■■■■■■■■■■■■■■■■■■■■■■
  0.301 [8]	|■■■■■■■■■■■■■■■■■■■■■■■■■
  0.330 [9]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.358 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 0.2222 secs
  25% in 0.2563 secs
  50% in 0.2903 secs
  75% in 0.3355 secs
  90% in 0.3533 secs
  95% in 0.3578 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0023 secs, 0.0759 secs, 0.3579 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0002 secs, 0.0000 secs, 0.0006 secs
  resp wait:	0.2813 secs, 0.0748 secs, 0.3567 secs
  resp read:	0.0001 secs, 0.0001 secs, 0.0003 secs

Status code distribution:
  [200]	50 responses